Revit 2027 API
BuiltInFailures.MEPCalculationFailures.DemandFlowNotSetInLossFamily Property
 A calculation did not complete because the Demand Flow for the element is not set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DemandFlowNotSetInLossFamily { get; }
Public Shared ReadOnly Property DemandFlowNotSetInLossFamily As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DemandFlowNotSetInLossFamily {
	FailureDefinitionId^ get ();
}
static member DemandFlowNotSetInLossFamily : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace